2019.07.23.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-07-23 Tue 09:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OCaml Weekly News</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">OCaml Weekly News</h1>
<p>
<a href="http://alan.petitepomme.net/cwn/2019.07.16.html">Previous Week</a> <a href="http://alan.petitepomme.net/cwn/index.html">Up</a> <a href="http://alan.petitepomme.net/cwn/2019.07.30.html">Next Week</a>
</p>

<p>
Hello
</p>

<p>
Here is the latest OCaml Weekly News, for the week of July 16 to 23, 2019.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#1">MirageOS retreat September 23rd - 29th</a></li>
<li><a href="#2">Some MirageOS unikernels: DNS servers, CalDAV</a></li>
<li><a href="#3">OCaml 4.08.1+rc1</a></li>
<li><a href="#4">soupault: a static website generator based on HTML rewriting</a></li>
<li><a href="#5">Genprint - general value printing</a></li>
<li><a href="#6">Printing arbitrary data in OCaml?</a></li>
<li><a href="#7">Other OCaml News</a></li>
<li><a href="#orga46c9ef">Old CWN</a></li>
</ul>
</div>
</div>


<div id="outline-container-org1b9fcb8" class="outline-2">
<h2 id="1">MirageOS retreat September 23rd - 29th</h2>
<div class="outline-text-2" id="text-1">
<p>
Archive: <a href="https://discuss.ocaml.org/t/mirageos-retreat-september-23rd-29th/4114/1">https://discuss.ocaml.org/t/mirageos-retreat-september-23rd-29th/4114/1</a>
</p>
</div>

<div id="outline-container-orge86c1a6" class="outline-3">
<h3 id="orge86c1a6">Hannes Mehnert announced</h3>
<div class="outline-text-3" id="text-orge86c1a6">
<p>
Hey, the next MirageOS retreat will take place again in Marrakesh at the end of September. Reports from earlier retreats and more details are available at <a href="http://retreat.mirage.io">http://retreat.mirage.io</a> &#x2013; everybody welcome! please sign up rather sooner than later :)
</p>
</div>
</div>
</div>




<div id="outline-container-orgdd57faa" class="outline-2">
<h2 id="2">Some MirageOS unikernels: DNS servers, CalDAV</h2>
<div class="outline-text-2" id="text-2">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-some-mirageos-unikernels-dns-servers-caldav/4115/1">https://discuss.ocaml.org/t/ann-some-mirageos-unikernels-dns-servers-caldav/4115/1</a>
</p>
</div>

<div id="outline-container-org251541f" class="outline-3">
<h3 id="org251541f">Hannes Mehnert announced</h3>
<div class="outline-text-3" id="text-org251541f">
<p>
Hi, apart from libraries and development tools, we've been working quite a bit on more realistic MirageOS applications which may be useful for you. Namely DNS authoritative servers (primary that has their zones in a git remote, secondaries, let's encrypt provisioning (all done via DNS)) and a CalDAV server. In addition, we are doing some monitoring (Grafana + influx) of the running unikernels (themselves and the host system), and are positive that we are spending less CPU ticks (~x4) and less memory (easily an order of magnitude) by replacing our Unix-based CalDAV server (same OCaml code base) with a MirageOS virtual machine / unikernel. Thanks to all who made this possible.
</p>

<p>
If you're interested in this line of work (including installation instructions which use an opam overlay for unreleased packages - let us know if it works or does not work for you), please have a look at <a href="https://hannes.nqsb.io/Posts/Summer2019">https://hannes.nqsb.io/Posts/Summer2019</a>
</p>
</div>
</div>
</div>




<div id="outline-container-org16e8299" class="outline-2">
<h2 id="3">OCaml 4.08.1+rc1</h2>
<div class="outline-text-2" id="text-3">
<p>
Archive: <a href="https://sympa.inria.fr/sympa/arc/caml-list/2019-07/msg00027.html">https://sympa.inria.fr/sympa/arc/caml-list/2019-07/msg00027.html</a>
</p>
</div>

<div id="outline-container-orga967196" class="outline-3">
<h3 id="orga967196">Florian Angeletti announced</h3>
<div class="outline-text-3" id="text-orga967196">
<p>
The release of OCaml version 4.08.1 is imminent.
This new bugfix release fixes some compilation failures in presence of "-pack",
and some native-code alignment issues on ARM64, PPC64 and amd64.
We have created a release candidate that you can test.
</p>

<p>
The source code is available at these addresses:
</p>

<p>
<a href="https://github.com/ocaml/ocaml/archive/4.08.1+rc1.tar.gz">https://github.com/ocaml/ocaml/archive/4.08.1+rc1.tar.gz</a> <br />
<a href="https://caml.inria.fr/pub/distrib/ocaml-4.08/ocaml-4.08.1+rc1.tar.gz">https://caml.inria.fr/pub/distrib/ocaml-4.08/ocaml-4.08.1+rc1.tar.gz</a>
</p>

<p>
The compiler can also be installed as an OPAM switch with one of the
following commands:
</p>

<pre class="example">
opam switch create ocaml-variants.4.08.1+rc1 --repositories=default,ocaml-beta=git+https://github.com/ocaml/ocaml-beta-repository.git
</pre>

<p>
or
</p>

<pre class="example">
opam switch create ocaml-variants.4.08.1+rc1+&lt;VARIANT&gt; --repositories=default,ocaml-beta=git+https://github.com/ocaml/ocaml-beta-repository.git
</pre>

<p>
where you replace &lt;VARIANT&gt; with one of these:
</p>
<ul class="org-ul">
<li>afl</li>
<li>default-unsafe-string</li>
<li>force-safe-string</li>
<li>flambda</li>
<li>fp</li>
<li>fp+flambda</li>
</ul>

<p>
We want to know about all bugs. Please report them here:
<a href="https://github.com/ocaml/ocaml/issues">https://github.com/ocaml/ocaml/issues</a>
</p>

<p>
Happy hacking,
— Florian Angeletti, for the OCaml team.
</p>
</div>


<div id="outline-container-org684be0a" class="outline-4">
<h4 id="org684be0a">OCaml 4.08.1 changes:</h4>
<div class="outline-text-4" id="text-org684be0a">
</div>
<ul class="org-ul">
<li><a id="orgf704e3b"></a>Bug fixes:<br />
<div class="outline-text-5" id="text-orgf704e3b">
<ul class="org-ul">
<li>#7887: ensure frame table is 8-aligned on ARM64 and PPC64</li>
</ul>
<p>
(Xavier Leroy, report by Mark Hayden, review by Mark Shinwell
and Gabriel Scherer)
</p>

<ul class="org-ul">
<li>#8751: fix bug that could result in misaligned data section when compiling to</li>
</ul>
<p>
native-code on amd64. (observed with the mingw64 compiler)
(Nicolás Ojeda Bär, review by David Allsopp)
</p>

<ul class="org-ul">
<li>#8769, #8770: Fix assertion failure with -pack</li>
</ul>
<p>
(Leo White, review by Gabriel Scherer, report by Fabian @copy)
</p>
</div>
</li>
</ul>
</div>
</div>


<div id="outline-container-org3026638" class="outline-3">
<h3 id="org3026638">Anil Madhavapeddy then said</h3>
<div class="outline-text-3" id="text-org3026638">
<p>
The Docker containers in the opam repository CI [1,2] have all now been rebuilt to reflect the latest contents of the 4.08 branch as per Florian's message.  This means that your 4.08 CI tests will now reflect the bug fixes below, and so (for example) nocrypto should be installable now.
</p>

<p>
[1] <a href="https://hub.docker.com/r/ocaml/opam2/">https://hub.docker.com/r/ocaml/opam2/</a> <br />
[2] <a href="https://github.com/ocaml/infrastructure/wiki/Containers">https://github.com/ocaml/infrastructure/wiki/Containers</a>
</p>
</div>
</div>
</div>




<div id="outline-container-org0e84b94" class="outline-2">
<h2 id="4">soupault: a static website generator based on HTML rewriting</h2>
<div class="outline-text-2" id="text-4">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-soupault-a-static-website-generator-based-on-html-rewriting/4126/1">https://discuss.ocaml.org/t/ann-soupault-a-static-website-generator-based-on-html-rewriting/4126/1</a>
</p>
</div>

<div id="outline-container-org005a761" class="outline-3">
<h3 id="org005a761">Daniil Baturin announced</h3>
<div class="outline-text-3" id="text-org005a761">
<p>
<a href="https://baturin.org/projects/soupault/">https://baturin.org/projects/soupault/</a>
</p>

<p>
Soupault is the first (to my knowledge) website generator that exploits the fact that well-formed HTML is machine readable and transformable (and thanks to @aantron's lambdasoup it's quite easy to do).
</p>

<p>
It can do things like "use the first <code>&lt;h1&gt;</code> for the page title" or "insert output of <code>date -R</code> into the <code>&lt;time&gt;</code> element no matter where it's in the page".
</p>

<p>
Features:
</p>
<ul class="org-ul">
<li>No templates, no themes, no front matter. You tell it where to insert stuff or what to extract using CSS selectors.</li>
<li>Built-in ToC, footnotes, and breadcrumbs.</li>
<li>Directories are site sections and can be nested.</li>
<li>Extracted metadata can be exported to JSON and fed to external scripts for creating section indices or custom taxonomies.</li>
<li>Configurable preprocessors for pages in formats other than HTML.</li>
</ul>

<p>
Soupault can be a drop-in automation tool for existing websites: the directory structure is fully configurable, clean URLs are optional, and it can preserve paths down to file extensions.
</p>
</div>
</div>
</div>




<div id="outline-container-org3be7043" class="outline-2">
<h2 id="5">Genprint - general value printing</h2>
<div class="outline-text-2" id="text-5">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-genprint-general-value-printing/3912/13">https://discuss.ocaml.org/t/ann-genprint-general-value-printing/3912/13</a>
</p>
</div>

<div id="outline-container-org25e6463" class="outline-3">
<h3 id="org25e6463">progman announced</h3>
<div class="outline-text-3" id="text-org25e6463">
<p>
Genprint is now available as a library. It uses a PPX extension.
Working with OCaml versions from 4.02.
</p>

<p>
<a href="http://github.com/progman1/genprintlib">http://github.com/progman1/genprintlib</a> (general value printing in compiled code)
</p>

<p>
Available through the official opam repository.
</p>
</div>
</div>
</div>




<div id="outline-container-org2c4cbb6" class="outline-2">
<h2 id="6">Printing arbitrary data in OCaml?</h2>
<div class="outline-text-2" id="text-6">
<p>
Archive: <a href="https://discuss.ocaml.org/t/printing-arbitrary-data-in-ocaml/4127/1">https://discuss.ocaml.org/t/printing-arbitrary-data-in-ocaml/4127/1</a>
</p>
</div>

<div id="outline-container-org4e20316" class="outline-3">
<h3 id="org4e20316">Zeroexcuses asked</h3>
<div class="outline-text-3" id="text-org4e20316">
<p>
For OCaml, is there a way to print <span class="underline">arbitrary</span> data, or do I need to write a custom printer for every object?
</p>

<p>
In Rust, I can do something like
</p>
<pre class="example">
#[derive(Deubg)]
struct ...
</pre>
<p>
and then it will auto derive a way to print the data for me.
</p>

<p>
In Clojure, most objects can be printed as is.
</p>

<p>
In OCaml, is there a way to print objects without writing a custom printer function?
</p>
</div>
</div>


<div id="outline-container-org4a59b0d" class="outline-3">
<h3 id="org4a59b0d">Thierry Martinez replied</h3>
<div class="outline-text-3" id="text-org4a59b0d">
<p>
There exist some deriving mechanisms in OCaml quite similar to those you know in Rust (or Haskell): they are implemented by PPX syntax extensions, namely <a href="https://github.com/ocaml-ppx/ppxlib"><code>ppxlib</code></a> or <a href="https://github.com/ocaml-ppx/ppx_deriving"><code>ppx_deriving</code></a>. With such extensions, you may write for instance:
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #000000; font-weight: bold;">type</span> <span style="color: #228b22;">example</span> = <span style="color: #000000; background-color: #ffffff;">A</span> | <span style="color: #000000; background-color: #ffffff;">B</span> <span style="color: #483d8b;">[@@deriving show]</span>
</pre>
</div>

<p>
and two functions <code>pp_example : Formatter.formatter -&gt; example -&gt; unit</code> and <code>show_example : example -&gt; string</code> will be automatically generated next to the type declaration. (<code>show</code> comes as a standard plugin with <code>ppx_deriving</code>; if you prefer to use <code>ppxlib</code>, you will need an additional plugin for <code>show</code>: you may use my <a href="https://gitlab.inria.fr/tmartine/ppx_show/"><code>ppx_show</code></a> plugin.)
</p>
</div>
</div>


<div id="outline-container-orgc96c8a4" class="outline-3">
<h3 id="orgc96c8a4">Chet Murthy also replied</h3>
<div class="outline-text-3" id="text-orgc96c8a4">
<p>
You may have seen "genprint" announced just today; it's also a way to print arbitrary values, via a different pathway.
</p>
</div>
</div>
</div>




<div id="outline-container-org92cc559" class="outline-2">
<h2 id="7">Other OCaml News</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgb9632d0" class="outline-3">
<h3 id="orgb9632d0">From the ocamlcore planet blog</h3>
<div class="outline-text-3" id="text-orgb9632d0">
<p>
Here are links from many OCaml blogs aggregated at <a href="http://ocaml.org/community/planet/">OCaml Planet</a>.
</p>

<ul class="org-ul">
<li><a href="https://ocsigen.github.io/blog/2019/07/18/releases/">Ocsigen Start and Ocsigen Server updated</a></li>
</ul>
</div>
</div>
</div>




<div id="outline-container-orga46c9ef" class="outline-2">
<h2 id="orga46c9ef">Old CWN</h2>
<div class="outline-text-2" id="text-orga46c9ef">
<p>
If you happen to miss a CWN, you can <a href="mailto:alan.schmitt@polytechnique.org">send me a message</a> and I'll mail it to you, or go take a look at <a href="http://alan.petitepomme.net/cwn/">the archive</a> or the <a href="http://alan.petitepomme.net/cwn/cwn.rss">RSS feed of the archives</a>.
</p>

<p>
If you also wish to receive it every week by mail, you may subscribe <a href="http://lists.idyll.org/listinfo/caml-news-weekly/">online</a>.
</p>

<div class="authorname">
<p>
<a href="http://alan.petitepomme.net/">Alan Schmitt</a>
</p>

</div>
</div>
</div>
</div>
</body>
</html>
